Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/eth.h
/* -------- ETH_IMR : (ETH Offset: 0x1030) ( R/ 32) Interrupt Mask Register -------- */
#define ETH_IMR_RESETVALUE                    _UINT32_(0x3FFFFFFF)                                 /*  (ETH_IMR) Interrupt Mask Register  Reset Value */

#define ETH_IMR_MFS_Pos                       _UINT32_(0)                                          /* (ETH_IMR) Management Frame Sent Position */
#define ETH_IMR_MFS_Msk                       (_UINT32_(0x1) << ETH_IMR_MFS_Pos)                   /* (ETH_IMR) Management Frame Sent Mask */
#define ETH_IMR_MFS(value)                    (ETH_IMR_MFS_Msk & (_UINT32_(value) << ETH_IMR_MFS_Pos)) /* Assignment of value for MFS in the ETH_IMR register */
#define ETH_IMR_RCOMP_Pos                     _UINT32_(1)                                          /* (ETH_IMR) Receive Complete Position */
#define ETH_IMR_RCOMP_Msk                     (_UINT32_(0x1) << ETH_IMR_RCOMP_Pos)                 /* (ETH_IMR) Receive Complete Mask */
#define ETH_IMR_RCOMP(value)                  (ETH_IMR_RCOMP_Msk & (_UINT32_(value) << ETH_IMR_RCOMP_Pos)) /* Assignment of value for RCOMP in the ETH_IMR register */
#define ETH_IMR_RXUBR_Pos                     _UINT32_(2)                                          /* (ETH_IMR) RX Used Bit Read Position */
#define ETH_IMR_RXUBR_Msk                     (_UINT32_(0x1) << ETH_IMR_RXUBR_Pos)                 /* (ETH_IMR) RX Used Bit Read Mask */
#define ETH_IMR_RXUBR(value)                  (ETH_IMR_RXUBR_Msk & (_UINT32_(value) << ETH_IMR_RXUBR_Pos)) /* Assignment of value for RXUBR in the ETH_IMR register */
#define ETH_IMR_TXUBR_Pos                     _UINT32_(3)                                          /* (ETH_IMR) TX Used Bit Read Position */
#define ETH_IMR_TXUBR_Msk                     (_UINT32_(0x1) << ETH_IMR_TXUBR_Pos)                 /* (ETH_IMR) TX Used Bit Read Mask */
#define ETH_IMR_TXUBR(value)                  (ETH_IMR_TXUBR_Msk & (_UINT32_(value) << ETH_IMR_TXUBR_Pos)) /* Assignment of value for TXUBR in the ETH_IMR register */
#define ETH_IMR_TUR_Pos                       _UINT32_(4)                                          /* (ETH_IMR) Transmit Underrun Position */
#define ETH_IMR_TUR_Msk                       (_UINT32_(0x1) << ETH_IMR_TUR_Pos)                   /* (ETH_IMR) Transmit Underrun Mask */
#define ETH_IMR_TUR(value)                    (ETH_IMR_TUR_Msk & (_UINT32_(value) << ETH_IMR_TUR_Pos)) /* Assignment of value for TUR in the ETH_IMR register */
#define ETH_IMR_RLEX_Pos                      _UINT32_(5)                                          /* (ETH_IMR) Retry Limit Exceeded or Late Collision Position */
#define ETH_IMR_RLEX_Msk                      (_UINT32_(0x1) << ETH_IMR_RLEX_Pos)                  /* (ETH_IMR) Retry Limit Exceeded or Late Collision Mask */
#define ETH_IMR_RLEX(value)                   (ETH_IMR_RLEX_Msk & (_UINT32_(value) << ETH_IMR_RLEX_Pos)) /* Assignment of value for RLEX in the ETH_IMR register */
#define ETH_IMR_TFC_Pos                       _UINT32_(6)                                          /* (ETH_IMR) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_IMR_TFC_Msk                       (_UINT32_(0x1) << ETH_IMR_TFC_Pos)                   /* (ETH_IMR) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_IMR_TFC(value)                    (ETH_IMR_TFC_Msk & (_UINT32_(value) << ETH_IMR_TFC_Pos)) /* Assignment of value for TFC in the ETH_IMR register */
#define ETH_IMR_TCOMP_Pos                     _UINT32_(7)                                          /* (ETH_IMR) Transmit Complete Position */
#define ETH_IMR_TCOMP_Msk                     (_UINT32_(0x1) << ETH_IMR_TCOMP_Pos)                 /* (ETH_IMR) Transmit Complete Mask */
#define ETH_IMR_TCOMP(value)                  (ETH_IMR_TCOMP_Msk & (_UINT32_(value) << ETH_IMR_TCOMP_Pos)) /* Assignment of value for TCOMP in the ETH_IMR register */
#define ETH_IMR_LCH_Pos                       _UINT32_(9)                                          /* (ETH_IMR) Link Change Position */
#define ETH_IMR_LCH_Msk                       (_UINT32_(0x1) << ETH_IMR_LCH_Pos)                   /* (ETH_IMR) Link Change Mask */
#define ETH_IMR_LCH(value)                    (ETH_IMR_LCH_Msk & (_UINT32_(value) << ETH_IMR_LCH_Pos)) /* Assignment of value for LCH in the ETH_IMR register */
#define ETH_IMR_ROVR_Pos                      _UINT32_(10)                                         /* (ETH_IMR) Receive Overrun Position */
#define ETH_IMR_ROVR_Msk                      (_UINT32_(0x1) << ETH_IMR_ROVR_Pos)                  /* (ETH_IMR) Receive Overrun Mask */
#define ETH_IMR_ROVR(value)                   (ETH_IMR_ROVR_Msk & (_UINT32_(value) << ETH_IMR_ROVR_Pos)) /* Assignment of value for ROVR in the ETH_IMR register */
#define ETH_IMR_HRESP_Pos                     _UINT32_(11)                                         /* (ETH_IMR) HRESP Not OK Position */
#define ETH_IMR_HRESP_Msk                     (_UINT32_(0x1) << ETH_IMR_HRESP_Pos)                 /* (ETH_IMR) HRESP Not OK Mask */
#define ETH_IMR_HRESP(value)                  (ETH_IMR_HRESP_Msk & (_UINT32_(value) << ETH_IMR_HRESP_Pos)) /* Assignment of value for HRESP in the ETH_IMR register */
#define ETH_IMR_PFNZ_Pos                      _UINT32_(12)                                         /* (ETH_IMR) Pause Frame with Non-zero Pause Quantum Received Position */
#define ETH_IMR_PFNZ_Msk                      (_UINT32_(0x1) << ETH_IMR_PFNZ_Pos)                  /* (ETH_IMR) Pause Frame with Non-zero Pause Quantum Received Mask */
#define ETH_IMR_PFNZ(value)                   (ETH_IMR_PFNZ_Msk & (_UINT32_(value) << ETH_IMR_PFNZ_Pos)) /* Assignment of value for PFNZ in the ETH_IMR register */
#define ETH_IMR_PTZ_Pos                       _UINT32_(13)                                         /* (ETH_IMR) Pause Time Zero Position */
#define ETH_IMR_PTZ_Msk                       (_UINT32_(0x1) << ETH_IMR_PTZ_Pos)                   /* (ETH_IMR) Pause Time Zero Mask */
#define ETH_IMR_PTZ(value)                    (ETH_IMR_PTZ_Msk & (_UINT32_(value) << ETH_IMR_PTZ_Pos)) /* Assignment of value for PTZ in the ETH_IMR register */
#define ETH_IMR_PFTR_Pos                      _UINT32_(14)                                         /* (ETH_IMR) Pause Frame Transmitted Position */
#define ETH_IMR_PFTR_Msk                      (_UINT32_(0x1) << ETH_IMR_PFTR_Pos)                  /* (ETH_IMR) Pause Frame Transmitted Mask */
#define ETH_IMR_PFTR(value)                   (ETH_IMR_PFTR_Msk & (_UINT32_(value) << ETH_IMR_PFTR_Pos)) /* Assignment of value for PFTR in the ETH_IMR register */
#define ETH_IMR_EXINT_Pos                     _UINT32_(15)                                         /* (ETH_IMR) External Interrupt Position */
#define ETH_IMR_EXINT_Msk                     (_UINT32_(0x1) << ETH_IMR_EXINT_Pos)                 /* (ETH_IMR) External Interrupt Mask */
#define ETH_IMR_EXINT(value)                  (ETH_IMR_EXINT_Msk & (_UINT32_(value) << ETH_IMR_EXINT_Pos)) /* Assignment of value for EXINT in the ETH_IMR register */
#define ETH_IMR_ANEG_Pos                      _UINT32_(16)                                         /* (ETH_IMR) PCS Auto-Negotiation Complete Position */
#define ETH_IMR_ANEG_Msk                      (_UINT32_(0x1) << ETH_IMR_ANEG_Pos)                  /* (ETH_IMR) PCS Auto-Negotiation Complete Mask */
#define ETH_IMR_ANEG(value)                   (ETH_IMR_ANEG_Msk & (_UINT32_(value) << ETH_IMR_ANEG_Pos)) /* Assignment of value for ANEG in the ETH_IMR register */
#define ETH_IMR_LPPRX_Pos                     _UINT32_(17)                                         /* (ETH_IMR) PCS Link Partner Page Received Position */
#define ETH_IMR_LPPRX_Msk                     (_UINT32_(0x1) << ETH_IMR_LPPRX_Pos)                 /* (ETH_IMR) PCS Link Partner Page Received Mask */
#define ETH_IMR_LPPRX(value)                  (ETH_IMR_LPPRX_Msk & (_UINT32_(value) << ETH_IMR_LPPRX_Pos)) /* Assignment of value for LPPRX in the ETH_IMR register */
#define ETH_IMR_DRQFR_Pos                     _UINT32_(18)                                         /* (ETH_IMR) PTP Delay Request Frame Received Position */
#define ETH_IMR_DRQFR_Msk                     (_UINT32_(0x1) << ETH_IMR_DRQFR_Pos)                 /* (ETH_IMR) PTP Delay Request Frame Received Mask */
#define ETH_IMR_DRQFR(value)                  (ETH_IMR_DRQFR_Msk & (_UINT32_(value) << ETH_IMR_DRQFR_Pos)) /* Assignment of value for DRQFR in the ETH_IMR register */
#define ETH_IMR_SFR_Pos                       _UINT32_(19)                                         /* (ETH_IMR) PTP Sync Frame Received Position */
#define ETH_IMR_SFR_Msk                       (_UINT32_(0x1) << ETH_IMR_SFR_Pos)                   /* (ETH_IMR) PTP Sync Frame Received Mask */
#define ETH_IMR_SFR(value)                    (ETH_IMR_SFR_Msk & (_UINT32_(value) << ETH_IMR_SFR_Pos)) /* Assignment of value for SFR in the ETH_IMR register */
#define ETH_IMR_DRQFT_Pos                     _UINT32_(20)                                         /* (ETH_IMR) PTP Delay Request Frame Transmitted Position */
#define ETH_IMR_DRQFT_Msk                     (_UINT32_(0x1) << ETH_IMR_DRQFT_Pos)                 /* (ETH_IMR) PTP Delay Request Frame Transmitted Mask */
#define ETH_IMR_DRQFT(value)                  (ETH_IMR_DRQFT_Msk & (_UINT32_(value) << ETH_IMR_DRQFT_Pos)) /* Assignment of value for DRQFT in the ETH_IMR register */
#define ETH_IMR_SFT_Pos                       _UINT32_(21)                                         /* (ETH_IMR) PTP Sync Frame Transmitted Position */
#define ETH_IMR_SFT_Msk                       (_UINT32_(0x1) << ETH_IMR_SFT_Pos)                   /* (ETH_IMR) PTP Sync Frame Transmitted Mask */
#define ETH_IMR_SFT(value)                    (ETH_IMR_SFT_Msk & (_UINT32_(value) << ETH_IMR_SFT_Pos)) /* Assignment of value for SFT in the ETH_IMR register */
#define ETH_IMR_PDRQFR_Pos                    _UINT32_(22)                                         /* (ETH_IMR) PDelay Request Frame Received Position */
#define ETH_IMR_PDRQFR_Msk                    (_UINT32_(0x1) << ETH_IMR_PDRQFR_Pos)                /* (ETH_IMR) PDelay Request Frame Received Mask */
#define ETH_IMR_PDRQFR(value)                 (ETH_IMR_PDRQFR_Msk & (_UINT32_(value) << ETH_IMR_PDRQFR_Pos)) /* Assignment of value for PDRQFR in the ETH_IMR register */
#define ETH_IMR_PDRSFR_Pos                    _UINT32_(23)                                         /* (ETH_IMR) PDelay Response Frame Received Position */
#define ETH_IMR_PDRSFR_Msk                    (_UINT32_(0x1) << ETH_IMR_PDRSFR_Pos)                /* (ETH_IMR) PDelay Response Frame Received Mask */
#define ETH_IMR_PDRSFR(value)                 (ETH_IMR_PDRSFR_Msk & (_UINT32_(value) << ETH_IMR_PDRSFR_Pos)) /* Assignment of value for PDRSFR in the ETH_IMR register */
#define ETH_IMR_PDRQFT_Pos                    _UINT32_(24)                                         /* (ETH_IMR) PDelay Request Frame Transmitted Position */
#define ETH_IMR_PDRQFT_Msk                    (_UINT32_(0x1) << ETH_IMR_PDRQFT_Pos)                /* (ETH_IMR) PDelay Request Frame Transmitted Mask */
#define ETH_IMR_PDRQFT(value)                 (ETH_IMR_PDRQFT_Msk & (_UINT32_(value) << ETH_IMR_PDRQFT_Pos)) /* Assignment of value for PDRQFT in the ETH_IMR register */
#define ETH_IMR_PDRSFT_Pos                    _UINT32_(25)                                         /* (ETH_IMR) PDelay Response Frame Transmitted Position */
#define ETH_IMR_PDRSFT_Msk                    (_UINT32_(0x1) << ETH_IMR_PDRSFT_Pos)                /* (ETH_IMR) PDelay Response Frame Transmitted Mask */
#define ETH_IMR_PDRSFT(value)                 (ETH_IMR_PDRSFT_Msk & (_UINT32_(value) << ETH_IMR_PDRSFT_Pos)) /* Assignment of value for PDRSFT in the ETH_IMR register */
#define ETH_IMR_SRI_Pos                       _UINT32_(26)                                         /* (ETH_IMR) TSU Seconds Register Increment Position */
#define ETH_IMR_SRI_Msk                       (_UINT32_(0x1) << ETH_IMR_SRI_Pos)                   /* (ETH_IMR) TSU Seconds Register Increment Mask */
#define ETH_IMR_SRI(value)                    (ETH_IMR_SRI_Msk & (_UINT32_(value) << ETH_IMR_SRI_Pos)) /* Assignment of value for SRI in the ETH_IMR register */
#define ETH_IMR_LPIRX_Pos                     _UINT32_(27)                                         /* (ETH_IMR) Receive LPI Indication Position */
#define ETH_IMR_LPIRX_Msk                     (_UINT32_(0x1) << ETH_IMR_LPIRX_Pos)                 /* (ETH_IMR) Receive LPI Indication Mask */
#define ETH_IMR_LPIRX(value)                  (ETH_IMR_LPIRX_Msk & (_UINT32_(value) << ETH_IMR_LPIRX_Pos)) /* Assignment of value for LPIRX in the ETH_IMR register */
#define ETH_IMR_WOL_Pos                       _UINT32_(28)                                         /* (ETH_IMR) Wake On LAN Position */
#define ETH_IMR_WOL_Msk                       (_UINT32_(0x1) << ETH_IMR_WOL_Pos)                   /* (ETH_IMR) Wake On LAN Mask */
#define ETH_IMR_WOL(value)                    (ETH_IMR_WOL_Msk & (_UINT32_(value) << ETH_IMR_WOL_Pos)) /* Assignment of value for WOL in the ETH_IMR register */
#define ETH_IMR_TSUCMP_Pos                    _UINT32_(29)                                         /* (ETH_IMR) Tsu timer comparison Position */
#define ETH_IMR_TSUCMP_Msk                    (_UINT32_(0x1) << ETH_IMR_TSUCMP_Pos)                /* (ETH_IMR) Tsu timer comparison Mask */
#define ETH_IMR_TSUCMP(value)                 (ETH_IMR_TSUCMP_Msk & (_UINT32_(value) << ETH_IMR_TSUCMP_Pos)) /* Assignment of value for TSUCMP in the ETH_IMR register */
#define ETH_IMR_Msk                           _UINT32_(0x3FFFFEFF)                                 /* (ETH_IMR) Register Mask  */


/* -------- ETH_MAN : (ETH Offset: 0x1034) (R/W 32) PHY Maintenance Register -------- */
#define ETH_MAN_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MAN) PHY Maintenance Register  Reset Value */

#define ETH_MAN_DATA_Pos                      _UINT32_(0)                                          /* (ETH_MAN) PHY Data Position */
#define ETH_MAN_DATA_Msk                      (_UINT32_(0xFFFF) << ETH_MAN_DATA_Pos)               /* (ETH_MAN) PHY Data Mask */
#define ETH_MAN_DATA(value)                   (ETH_MAN_DATA_Msk & (_UINT32_(value) << ETH_MAN_DATA_Pos)) /* Assignment of value for DATA in the ETH_MAN register */
#define ETH_MAN_WTN_Pos                       _UINT32_(16)                                         /* (ETH_MAN) Write Ten Position */
#define ETH_MAN_WTN_Msk                       (_UINT32_(0x3) << ETH_MAN_WTN_Pos)                   /* (ETH_MAN) Write Ten Mask */
#define ETH_MAN_WTN(value)                    (ETH_MAN_WTN_Msk & (_UINT32_(value) << ETH_MAN_WTN_Pos)) /* Assignment of value for WTN in the ETH_MAN register */
#define ETH_MAN_REGA_Pos                      _UINT32_(18)                                         /* (ETH_MAN) Register Address Position */
#define ETH_MAN_REGA_Msk                      (_UINT32_(0x1F) << ETH_MAN_REGA_Pos)                 /* (ETH_MAN) Register Address Mask */
#define ETH_MAN_REGA(value)                   (ETH_MAN_REGA_Msk & (_UINT32_(value) << ETH_MAN_REGA_Pos)) /* Assignment of value for REGA in the ETH_MAN register */
#define ETH_MAN_PHYA_Pos                      _UINT32_(23)                                         /* (ETH_MAN) PHY Address Position */
#define ETH_MAN_PHYA_Msk                      (_UINT32_(0x1F) << ETH_MAN_PHYA_Pos)                 /* (ETH_MAN) PHY Address Mask */
#define ETH_MAN_PHYA(value)                   (ETH_MAN_PHYA_Msk & (_UINT32_(value) << ETH_MAN_PHYA_Pos)) /* Assignment of value for PHYA in the ETH_MAN register */
#define ETH_MAN_OP_Pos                        _UINT32_(28)                                         /* (ETH_MAN) Operation Position */
#define ETH_MAN_OP_Msk                        (_UINT32_(0x3) << ETH_MAN_OP_Pos)                    /* (ETH_MAN) Operation Mask */
#define ETH_MAN_OP(value)                     (ETH_MAN_OP_Msk & (_UINT32_(value) << ETH_MAN_OP_Pos)) /* Assignment of value for OP in the ETH_MAN register */
#define ETH_MAN_CLTTO_Pos                     _UINT32_(30)                                         /* (ETH_MAN) Clause 22 Operation Position */
#define ETH_MAN_CLTTO_Msk                     (_UINT32_(0x1) << ETH_MAN_CLTTO_Pos)                 /* (ETH_MAN) Clause 22 Operation Mask */
#define ETH_MAN_CLTTO(value)                  (ETH_MAN_CLTTO_Msk & (_UINT32_(value) << ETH_MAN_CLTTO_Pos)) /* Assignment of value for CLTTO in the ETH_MAN register */
#define ETH_MAN_WZO_Pos                       _UINT32_(31)                                         /* (ETH_MAN) Write ZERO Position */
#define ETH_MAN_WZO_Msk                       (_UINT32_(0x1) << ETH_MAN_WZO_Pos)                   /* (ETH_MAN) Write ZERO Mask */
#define ETH_MAN_WZO(value)                    (ETH_MAN_WZO_Msk & (_UINT32_(value) << ETH_MAN_WZO_Pos)) /* Assignment of value for WZO in the ETH_MAN register */
#define ETH_MAN_Msk                           _UINT32_(0xFFFFFFFF)                                 /* (ETH_MAN) Register Mask  */


