Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/eth.h
#define ETH_TBFT511_NFTX_Pos                  _UINT32_(0)                                          /* (ETH_TBFT511) 256 to 511 Byte Frames Transmitted without Error Position */
#define ETH_TBFT511_NFTX_Msk                  (_UINT32_(0xFFFFFFFF) << ETH_TBFT511_NFTX_Pos)       /* (ETH_TBFT511) 256 to 511 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT511_NFTX(value)               (ETH_TBFT511_NFTX_Msk & (_UINT32_(value) << ETH_TBFT511_NFTX_Pos)) /* Assignment of value for NFTX in the ETH_TBFT511 register */
#define ETH_TBFT511_Msk                       _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT511) Register Mask  */


/* -------- ETH_TBFT1023 : (ETH Offset: 0x1128) (R/W 32) 512 to 1023 Byte Frames Transmitted Register -------- */
#define ETH_TBFT1023_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT1023_NFTX_Pos                 _UINT32_(0)                                          /* (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted without Error Position */
#define ETH_TBFT1023_NFTX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFT1023_NFTX_Pos)      /* (ETH_TBFT1023) 512 to 1023 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT1023_NFTX(value)              (ETH_TBFT1023_NFTX_Msk & (_UINT32_(value) << ETH_TBFT1023_NFTX_Pos)) /* Assignment of value for NFTX in the ETH_TBFT1023 register */
#define ETH_TBFT1023_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT1023) Register Mask  */


/* -------- ETH_TBFT1518 : (ETH Offset: 0x112C) (R/W 32) 1024 to 1518 Byte Frames Transmitted Register -------- */
#define ETH_TBFT1518_RESETVALUE               _UINT32_(0x00)                                       /*  (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted Register  Reset Value */

#define ETH_TBFT1518_NFTX_Pos                 _UINT32_(0)                                          /* (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted without Error Position */
#define ETH_TBFT1518_NFTX_Msk                 (_UINT32_(0xFFFFFFFF) << ETH_TBFT1518_NFTX_Pos)      /* (ETH_TBFT1518) 1024 to 1518 Byte Frames Transmitted without Error Mask */
#define ETH_TBFT1518_NFTX(value)              (ETH_TBFT1518_NFTX_Msk & (_UINT32_(value) << ETH_TBFT1518_NFTX_Pos)) /* Assignment of value for NFTX in the ETH_TBFT1518 register */
#define ETH_TBFT1518_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (ETH_TBFT1518) Register Mask  */


/* -------- ETH_GTBFT1518 : (ETH Offset: 0x1130) (R/W 32) Greater Than 1518 Byte Frames Transmitted Register -------- */
#define ETH_GTBFT1518_RESETVALUE              _UINT32_(0x00)                                       /*  (ETH_GTBFT1518) Greater Than 1518 Byte Frames Transmitted Register  Reset Value */

#define ETH_GTBFT1518_NFTX_Pos                _UINT32_(0)                                          /* (ETH_GTBFT1518) Greater than 1518 Byte Frames Transmitted without Error Position */
#define ETH_GTBFT1518_NFTX_Msk                (_UINT32_(0xFFFFFFFF) << ETH_GTBFT1518_NFTX_Pos)     /* (ETH_GTBFT1518) Greater than 1518 Byte Frames Transmitted without Error Mask */
#define ETH_GTBFT1518_NFTX(value)             (ETH_GTBFT1518_NFTX_Msk & (_UINT32_(value) << ETH_GTBFT1518_NFTX_Pos)) /* Assignment of value for NFTX in the ETH_GTBFT1518 register */
#define ETH_GTBFT1518_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ETH_GTBFT1518) Register Mask  */


/* -------- ETH_TUR : (ETH Offset: 0x1134) (R/W 32) Transmit Underruns Register -------- */
#define ETH_TUR_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_TUR) Transmit Underruns Register  Reset Value */

#define ETH_TUR_TXUNR_Pos                     _UINT32_(0)                                          /* (ETH_TUR) Transmit Underruns Position */
#define ETH_TUR_TXUNR_Msk                     (_UINT32_(0x3FF) << ETH_TUR_TXUNR_Pos)               /* (ETH_TUR) Transmit Underruns Mask */
#define ETH_TUR_TXUNR(value)                  (ETH_TUR_TXUNR_Msk & (_UINT32_(value) << ETH_TUR_TXUNR_Pos)) /* Assignment of value for TXUNR in the ETH_TUR register */
#define ETH_TUR_Msk                           _UINT32_(0x000003FF)                                 /* (ETH_TUR) Register Mask  */


/* -------- ETH_SCF : (ETH Offset: 0x1138) (R/W 32) Single Collision Frames Register -------- */
#define ETH_SCF_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_SCF) Single Collision Frames Register  Reset Value */

#define ETH_SCF_SCOL_Pos                      _UINT32_(0)                                          /* (ETH_SCF) Single Collision Position */
#define ETH_SCF_SCOL_Msk                      (_UINT32_(0x3FFFF) << ETH_SCF_SCOL_Pos)              /* (ETH_SCF) Single Collision Mask */
#define ETH_SCF_SCOL(value)                   (ETH_SCF_SCOL_Msk & (_UINT32_(value) << ETH_SCF_SCOL_Pos)) /* Assignment of value for SCOL in the ETH_SCF register */
#define ETH_SCF_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_SCF) Register Mask  */


/* -------- ETH_MCF : (ETH Offset: 0x113C) (R/W 32) Multiple Collision Frames Register -------- */
#define ETH_MCF_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_MCF) Multiple Collision Frames Register  Reset Value */

#define ETH_MCF_MCOL_Pos                      _UINT32_(0)                                          /* (ETH_MCF) Multiple Collision Position */
#define ETH_MCF_MCOL_Msk                      (_UINT32_(0x3FFFF) << ETH_MCF_MCOL_Pos)              /* (ETH_MCF) Multiple Collision Mask */
#define ETH_MCF_MCOL(value)                   (ETH_MCF_MCOL_Msk & (_UINT32_(value) << ETH_MCF_MCOL_Pos)) /* Assignment of value for MCOL in the ETH_MCF register */
#define ETH_MCF_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_MCF) Register Mask  */


/* -------- ETH_EC : (ETH Offset: 0x1140) (R/W 32) Excessive Collisions Register -------- */
#define ETH_EC_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_EC) Excessive Collisions Register  Reset Value */

#define ETH_EC_XCOL_Pos                       _UINT32_(0)                                          /* (ETH_EC) Excessive Collisions Position */
#define ETH_EC_XCOL_Msk                       (_UINT32_(0x3FF) << ETH_EC_XCOL_Pos)                 /* (ETH_EC) Excessive Collisions Mask */
#define ETH_EC_XCOL(value)                    (ETH_EC_XCOL_Msk & (_UINT32_(value) << ETH_EC_XCOL_Pos)) /* Assignment of value for XCOL in the ETH_EC register */
#define ETH_EC_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_EC) Register Mask  */


/* -------- ETH_LC : (ETH Offset: 0x1144) (R/W 32) Late Collisions Register -------- */
#define ETH_LC_RESETVALUE                     _UINT32_(0x00)                                       /*  (ETH_LC) Late Collisions Register  Reset Value */

#define ETH_LC_LCOL_Pos                       _UINT32_(0)                                          /* (ETH_LC) Late Collisions Position */
#define ETH_LC_LCOL_Msk                       (_UINT32_(0x3FF) << ETH_LC_LCOL_Pos)                 /* (ETH_LC) Late Collisions Mask */
#define ETH_LC_LCOL(value)                    (ETH_LC_LCOL_Msk & (_UINT32_(value) << ETH_LC_LCOL_Pos)) /* Assignment of value for LCOL in the ETH_LC register */
#define ETH_LC_Msk                            _UINT32_(0x000003FF)                                 /* (ETH_LC) Register Mask  */


/* -------- ETH_DTF : (ETH Offset: 0x1148) (R/W 32) Deferred Transmission Frames Register -------- */
#define ETH_DTF_RESETVALUE                    _UINT32_(0x00)                                       /*  (ETH_DTF) Deferred Transmission Frames Register  Reset Value */

#define ETH_DTF_DEFT_Pos                      _UINT32_(0)                                          /* (ETH_DTF) Deferred Transmission Position */
#define ETH_DTF_DEFT_Msk                      (_UINT32_(0x3FFFF) << ETH_DTF_DEFT_Pos)              /* (ETH_DTF) Deferred Transmission Mask */
#define ETH_DTF_DEFT(value)                   (ETH_DTF_DEFT_Msk & (_UINT32_(value) << ETH_DTF_DEFT_Pos)) /* Assignment of value for DEFT in the ETH_DTF register */
#define ETH_DTF_Msk                           _UINT32_(0x0003FFFF)                                 /* (ETH_DTF) Register Mask  */


