Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/eth.h
#define ETH_EFRN_RUD_Pos                      _UINT32_(0)                                          /* (ETH_EFRN) Register Update Position */
#define ETH_EFRN_RUD_Msk                      (_UINT32_(0x3FFFFFFF) << ETH_EFRN_RUD_Pos)           /* (ETH_EFRN) Register Update Mask */
#define ETH_EFRN_RUD(value)                   (ETH_EFRN_RUD_Msk & (_UINT32_(value) << ETH_EFRN_RUD_Pos)) /* Assignment of value for RUD in the ETH_EFRN register */
#define ETH_EFRN_Msk                          _UINT32_(0x3FFFFFFF)                                 /* (ETH_EFRN) Register Mask  */


/* -------- ETH_PEFTSL : (ETH Offset: 0x11F0) ( R/ 32) PTP Peer Event Frame Transmitted Seconds Low Register -------- */
#define ETH_PEFTSL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFTSL) PTP Peer Event Frame Transmitted Seconds Low Register  Reset Value */

#define ETH_PEFTSL_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFTSL) Register Update Position */
#define ETH_PEFTSL_RUD_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_PEFTSL_RUD_Pos)         /* (ETH_PEFTSL) Register Update Mask */
#define ETH_PEFTSL_RUD(value)                 (ETH_PEFTSL_RUD_Msk & (_UINT32_(value) << ETH_PEFTSL_RUD_Pos)) /* Assignment of value for RUD in the ETH_PEFTSL register */
#define ETH_PEFTSL_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_PEFTSL) Register Mask  */


/* -------- ETH_PEFTN : (ETH Offset: 0x11F4) ( R/ 32) PTP Peer Event Frame Transmitted Nanoseconds -------- */
#define ETH_PEFTN_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_PEFTN) PTP Peer Event Frame Transmitted Nanoseconds  Reset Value */

#define ETH_PEFTN_RUD_Pos                     _UINT32_(0)                                          /* (ETH_PEFTN) Register Update Position */
#define ETH_PEFTN_RUD_Msk                     (_UINT32_(0x3FFFFFFF) << ETH_PEFTN_RUD_Pos)          /* (ETH_PEFTN) Register Update Mask */
#define ETH_PEFTN_RUD(value)                  (ETH_PEFTN_RUD_Msk & (_UINT32_(value) << ETH_PEFTN_RUD_Pos)) /* Assignment of value for RUD in the ETH_PEFTN register */
#define ETH_PEFTN_Msk                         _UINT32_(0x3FFFFFFF)                                 /* (ETH_PEFTN) Register Mask  */


/* -------- ETH_PEFRSL : (ETH Offset: 0x11F8) ( R/ 32) PTP Peer Event Frame Received Seconds Low Register -------- */
#define ETH_PEFRSL_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_PEFRSL) PTP Peer Event Frame Received Seconds Low Register  Reset Value */

#define ETH_PEFRSL_RUD_Pos                    _UINT32_(0)                                          /* (ETH_PEFRSL) Register Update Position */
#define ETH_PEFRSL_RUD_Msk                    (_UINT32_(0xFFFFFFFF) << ETH_PEFRSL_RUD_Pos)         /* (ETH_PEFRSL) Register Update Mask */
#define ETH_PEFRSL_RUD(value)                 (ETH_PEFRSL_RUD_Msk & (_UINT32_(value) << ETH_PEFRSL_RUD_Pos)) /* Assignment of value for RUD in the ETH_PEFRSL register */
#define ETH_PEFRSL_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (ETH_PEFRSL) Register Mask  */


/* -------- ETH_PEFRN : (ETH Offset: 0x11FC) ( R/ 32) PTP Peer Event Frame Received Nanoseconds -------- */
#define ETH_PEFRN_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_PEFRN) PTP Peer Event Frame Received Nanoseconds  Reset Value */

#define ETH_PEFRN_RUD_Pos                     _UINT32_(0)                                          /* (ETH_PEFRN) Register Update Position */
#define ETH_PEFRN_RUD_Msk                     (_UINT32_(0x3FFFFFFF) << ETH_PEFRN_RUD_Pos)          /* (ETH_PEFRN) Register Update Mask */
#define ETH_PEFRN_RUD(value)                  (ETH_PEFRN_RUD_Msk & (_UINT32_(value) << ETH_PEFRN_RUD_Pos)) /* Assignment of value for RUD in the ETH_PEFRN register */
#define ETH_PEFRN_Msk                         _UINT32_(0x3FFFFFFF)                                 /* (ETH_PEFRN) Register Mask  */


/* -------- ETH_TPQ1 : (ETH Offset: 0x1260) (R/W 32) Transmit Pause Quantum Register 1 -------- */
#define ETH_TPQ1_RESETVALUE                   _UINT32_(0xFFFFFFFF)                                 /*  (ETH_TPQ1) Transmit Pause Quantum Register 1  Reset Value */

#define ETH_TPQ1_QP2_Pos                      _UINT32_(0)                                          /* (ETH_TPQ1) Transmit pause quantum priority 2 Position */
#define ETH_TPQ1_QP2_Msk                      (_UINT32_(0xFFFF) << ETH_TPQ1_QP2_Pos)               /* (ETH_TPQ1) Transmit pause quantum priority 2 Mask */
#define ETH_TPQ1_QP2(value)                   (ETH_TPQ1_QP2_Msk & (_UINT32_(value) << ETH_TPQ1_QP2_Pos)) /* Assignment of value for QP2 in the ETH_TPQ1 register */
#define ETH_TPQ1_QP3_Pos                      _UINT32_(16)                                         /* (ETH_TPQ1) Transmit pause quantum priority 3 Position */
#define ETH_TPQ1_QP3_Msk                      (_UINT32_(0xFFFF) << ETH_TPQ1_QP3_Pos)               /* (ETH_TPQ1) Transmit pause quantum priority 3 Mask */
#define ETH_TPQ1_QP3(value)                   (ETH_TPQ1_QP3_Msk & (_UINT32_(value) << ETH_TPQ1_QP3_Pos)) /* Assignment of value for QP3 in the ETH_TPQ1 register */
#define ETH_TPQ1_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_TPQ1) Register Mask  */


/* -------- ETH_TPQ2 : (ETH Offset: 0x1264) (R/W 32) Transmit Pause Quantum Register 2 -------- */
#define ETH_TPQ2_RESETVALUE                   _UINT32_(0xFFFFFFFF)                                 /*  (ETH_TPQ2) Transmit Pause Quantum Register 2  Reset Value */

#define ETH_TPQ2_QP4_Pos                      _UINT32_(0)                                          /* (ETH_TPQ2) Transmit pause quantum priority 4 Position */
#define ETH_TPQ2_QP4_Msk                      (_UINT32_(0xFFFF) << ETH_TPQ2_QP4_Pos)               /* (ETH_TPQ2) Transmit pause quantum priority 4 Mask */
#define ETH_TPQ2_QP4(value)                   (ETH_TPQ2_QP4_Msk & (_UINT32_(value) << ETH_TPQ2_QP4_Pos)) /* Assignment of value for QP4 in the ETH_TPQ2 register */
#define ETH_TPQ2_QP5_Pos                      _UINT32_(16)                                         /* (ETH_TPQ2) Transmit pause quantum priority 5 Position */
#define ETH_TPQ2_QP5_Msk                      (_UINT32_(0xFFFF) << ETH_TPQ2_QP5_Pos)               /* (ETH_TPQ2) Transmit pause quantum priority 5 Mask */
#define ETH_TPQ2_QP5(value)                   (ETH_TPQ2_QP5_Msk & (_UINT32_(value) << ETH_TPQ2_QP5_Pos)) /* Assignment of value for QP5 in the ETH_TPQ2 register */
#define ETH_TPQ2_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_TPQ2) Register Mask  */


/* -------- ETH_TPQ3 : (ETH Offset: 0x1268) (R/W 32) Transmit Pause Quantum Register 3 -------- */
#define ETH_TPQ3_RESETVALUE                   _UINT32_(0xFFFFFFFF)                                 /*  (ETH_TPQ3) Transmit Pause Quantum Register 3  Reset Value */

#define ETH_TPQ3_QP6_Pos                      _UINT32_(0)                                          /* (ETH_TPQ3) Transmit pause quantum priority 6 Position */
#define ETH_TPQ3_QP6_Msk                      (_UINT32_(0xFFFF) << ETH_TPQ3_QP6_Pos)               /* (ETH_TPQ3) Transmit pause quantum priority 6 Mask */
#define ETH_TPQ3_QP6(value)                   (ETH_TPQ3_QP6_Msk & (_UINT32_(value) << ETH_TPQ3_QP6_Pos)) /* Assignment of value for QP6 in the ETH_TPQ3 register */
#define ETH_TPQ3_QP7_Pos                      _UINT32_(16)                                         /* (ETH_TPQ3) Transmit pause quantum priority 7 Position */
#define ETH_TPQ3_QP7_Msk                      (_UINT32_(0xFFFF) << ETH_TPQ3_QP7_Pos)               /* (ETH_TPQ3) Transmit pause quantum priority 7 Mask */
#define ETH_TPQ3_QP7(value)                   (ETH_TPQ3_QP7_Msk & (_UINT32_(value) << ETH_TPQ3_QP7_Pos)) /* Assignment of value for QP7 in the ETH_TPQ3 register */
#define ETH_TPQ3_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (ETH_TPQ3) Register Mask  */


/* -------- ETH_RLPITR : (ETH Offset: 0x1270) ( R/ 32) Receive LPI transition Register -------- */
#define ETH_RLPITR_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_RLPITR) Receive LPI transition Register  Reset Value */

