Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_bootloader/test_app/firmware/src/packs/PIC32WM_BZ6204_DFP/component/eth.h
#define ETH_RLPITR_RLPITR_Pos                 _UINT32_(0)                                          /* (ETH_RLPITR) Count number of times transition from rx normal idle to low power idle Position */
#define ETH_RLPITR_RLPITR_Msk                 (_UINT32_(0xFFFF) << ETH_RLPITR_RLPITR_Pos)          /* (ETH_RLPITR) Count number of times transition from rx normal idle to low power idle Mask */
#define ETH_RLPITR_RLPITR(value)              (ETH_RLPITR_RLPITR_Msk & (_UINT32_(value) << ETH_RLPITR_RLPITR_Pos)) /* Assignment of value for RLPITR in the ETH_RLPITR register */
#define ETH_RLPITR_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_RLPITR) Register Mask  */


/* -------- ETH_RLPITI : (ETH Offset: 0x1274) ( R/ 32) Receive LPI Time Register -------- */
#define ETH_RLPITI_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_RLPITI) Receive LPI Time Register  Reset Value */

#define ETH_RLPITI_RLPITI_Pos                 _UINT32_(0)                                          /* (ETH_RLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode Position */
#define ETH_RLPITI_RLPITI_Msk                 (_UINT32_(0xFFFFFF) << ETH_RLPITI_RLPITI_Pos)        /* (ETH_RLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in rx mode Mask */
#define ETH_RLPITI_RLPITI(value)              (ETH_RLPITI_RLPITI_Msk & (_UINT32_(value) << ETH_RLPITI_RLPITI_Pos)) /* Assignment of value for RLPITI in the ETH_RLPITI register */
#define ETH_RLPITI_Msk                        _UINT32_(0x00FFFFFF)                                 /* (ETH_RLPITI) Register Mask  */


/* -------- ETH_TLPITR : (ETH Offset: 0x1278) ( R/ 32) Receive LPI transition Register -------- */
#define ETH_TLPITR_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TLPITR) Receive LPI transition Register  Reset Value */

#define ETH_TLPITR_TLPITR_Pos                 _UINT32_(0)                                          /* (ETH_TLPITR) Count number of times enable LPI tx bit 20 goes from low to high Position */
#define ETH_TLPITR_TLPITR_Msk                 (_UINT32_(0xFFFF) << ETH_TLPITR_TLPITR_Pos)          /* (ETH_TLPITR) Count number of times enable LPI tx bit 20 goes from low to high Mask */
#define ETH_TLPITR_TLPITR(value)              (ETH_TLPITR_TLPITR_Msk & (_UINT32_(value) << ETH_TLPITR_TLPITR_Pos)) /* Assignment of value for TLPITR in the ETH_TLPITR register */
#define ETH_TLPITR_Msk                        _UINT32_(0x0000FFFF)                                 /* (ETH_TLPITR) Register Mask  */


/* -------- ETH_TLPITI : (ETH Offset: 0x127C) ( R/ 32) Receive LPI Time Register -------- */
#define ETH_TLPITI_RESETVALUE                 _UINT32_(0x00)                                       /*  (ETH_TLPITI) Receive LPI Time Register  Reset Value */

#define ETH_TLPITI_TLPITI_Pos                 _UINT32_(0)                                          /* (ETH_TLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode Position */
#define ETH_TLPITI_TLPITI_Msk                 (_UINT32_(0xFFFFFF) << ETH_TLPITI_TLPITI_Pos)        /* (ETH_TLPITI) Increment once over 16 ahb clock when LPI indication bit 20 is set in tx mode Mask */
#define ETH_TLPITI_TLPITI(value)              (ETH_TLPITI_TLPITI_Msk & (_UINT32_(value) << ETH_TLPITI_TLPITI_Pos)) /* Assignment of value for TLPITI in the ETH_TLPITI register */
#define ETH_TLPITI_Msk                        _UINT32_(0x00FFFFFF)                                 /* (ETH_TLPITI) Register Mask  */


/* -------- ETH_DSNCFGDBG : (ETH Offset: 0x1280) ( R/ 32) Design Configuration Debug -------- */
#define ETH_DSNCFGDBG_RESETVALUE              _UINT32_(0x00)                                       /*  (ETH_DSNCFGDBG) Design Configuration Debug  Reset Value */

#define ETH_DSNCFGDBG_DSNCFGDBG_Pos           _UINT32_(0)                                          /* (ETH_DSNCFGDBG) Design Configuration Debug Position */
#define ETH_DSNCFGDBG_DSNCFGDBG_Msk           (_UINT32_(0xFFFFFFFF) << ETH_DSNCFGDBG_DSNCFGDBG_Pos) /* (ETH_DSNCFGDBG) Design Configuration Debug Mask */
#define ETH_DSNCFGDBG_DSNCFGDBG(value)        (ETH_DSNCFGDBG_DSNCFGDBG_Msk & (_UINT32_(value) << ETH_DSNCFGDBG_DSNCFGDBG_Pos)) /* Assignment of value for DSNCFGDBG in the ETH_DSNCFGDBG register */
#define ETH_DSNCFGDBG_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (ETH_DSNCFGDBG) Register Mask  */


/* -------- ETH_ISRQ : (ETH Offset: 0x1400) (R/W 32) Interrupt Status Register Queues -------- */
#define ETH_ISRQ_RESETVALUE                   _UINT32_(0x00)                                       /*  (ETH_ISRQ) Interrupt Status Register Queues  Reset Value */

#define ETH_ISRQ_RCOMP_Pos                    _UINT32_(1)                                          /* (ETH_ISRQ) Receive Complete Position */
#define ETH_ISRQ_RCOMP_Msk                    (_UINT32_(0x1) << ETH_ISRQ_RCOMP_Pos)                /* (ETH_ISRQ) Receive Complete Mask */
#define ETH_ISRQ_RCOMP(value)                 (ETH_ISRQ_RCOMP_Msk & (_UINT32_(value) << ETH_ISRQ_RCOMP_Pos)) /* Assignment of value for RCOMP in the ETH_ISRQ register */
#define ETH_ISRQ_RXUBR_Pos                    _UINT32_(2)                                          /* (ETH_ISRQ) RX Used Bit Read Position */
#define ETH_ISRQ_RXUBR_Msk                    (_UINT32_(0x1) << ETH_ISRQ_RXUBR_Pos)                /* (ETH_ISRQ) RX Used Bit Read Mask */
#define ETH_ISRQ_RXUBR(value)                 (ETH_ISRQ_RXUBR_Msk & (_UINT32_(value) << ETH_ISRQ_RXUBR_Pos)) /* Assignment of value for RXUBR in the ETH_ISRQ register */
#define ETH_ISRQ_TXUBR_Pos                    _UINT32_(3)                                          /* (ETH_ISRQ) TX Used Bit Read Position */
#define ETH_ISRQ_TXUBR_Msk                    (_UINT32_(0x1) << ETH_ISRQ_TXUBR_Pos)                /* (ETH_ISRQ) TX Used Bit Read Mask */
#define ETH_ISRQ_TXUBR(value)                 (ETH_ISRQ_TXUBR_Msk & (_UINT32_(value) << ETH_ISRQ_TXUBR_Pos)) /* Assignment of value for TXUBR in the ETH_ISRQ register */
#define ETH_ISRQ_TUR_Pos                      _UINT32_(4)                                          /* (ETH_ISRQ) Transmit Underrun Position */
#define ETH_ISRQ_TUR_Msk                      (_UINT32_(0x1) << ETH_ISRQ_TUR_Pos)                  /* (ETH_ISRQ) Transmit Underrun Mask */
#define ETH_ISRQ_TUR(value)                   (ETH_ISRQ_TUR_Msk & (_UINT32_(value) << ETH_ISRQ_TUR_Pos)) /* Assignment of value for TUR in the ETH_ISRQ register */
#define ETH_ISRQ_RLEX_Pos                     _UINT32_(5)                                          /* (ETH_ISRQ) Retry Limit Exceeded Position */
#define ETH_ISRQ_RLEX_Msk                     (_UINT32_(0x1) << ETH_ISRQ_RLEX_Pos)                 /* (ETH_ISRQ) Retry Limit Exceeded Mask */
#define ETH_ISRQ_RLEX(value)                  (ETH_ISRQ_RLEX_Msk & (_UINT32_(value) << ETH_ISRQ_RLEX_Pos)) /* Assignment of value for RLEX in the ETH_ISRQ register */
#define ETH_ISRQ_TFC_Pos                      _UINT32_(6)                                          /* (ETH_ISRQ) Transmit Frame Corruption Due to AHB Error Position */
#define ETH_ISRQ_TFC_Msk                      (_UINT32_(0x1) << ETH_ISRQ_TFC_Pos)                  /* (ETH_ISRQ) Transmit Frame Corruption Due to AHB Error Mask */
#define ETH_ISRQ_TFC(value)                   (ETH_ISRQ_TFC_Msk & (_UINT32_(value) << ETH_ISRQ_TFC_Pos)) /* Assignment of value for TFC in the ETH_ISRQ register */
#define ETH_ISRQ_TCOMP_Pos                    _UINT32_(7)                                          /* (ETH_ISRQ) Transmit Complete Position */
#define ETH_ISRQ_TCOMP_Msk                    (_UINT32_(0x1) << ETH_ISRQ_TCOMP_Pos)                /* (ETH_ISRQ) Transmit Complete Mask */
#define ETH_ISRQ_TCOMP(value)                 (ETH_ISRQ_TCOMP_Msk & (_UINT32_(value) << ETH_ISRQ_TCOMP_Pos)) /* Assignment of value for TCOMP in the ETH_ISRQ register */
#define ETH_ISRQ_ROVR_Pos                     _UINT32_(10)                                         /* (ETH_ISRQ) Receive Overrun Position */
#define ETH_ISRQ_ROVR_Msk                     (_UINT32_(0x1) << ETH_ISRQ_ROVR_Pos)                 /* (ETH_ISRQ) Receive Overrun Mask */
#define ETH_ISRQ_ROVR(value)                  (ETH_ISRQ_ROVR_Msk & (_UINT32_(value) << ETH_ISRQ_ROVR_Pos)) /* Assignment of value for ROVR in the ETH_ISRQ register */
#define ETH_ISRQ_HRESP_Pos                    _UINT32_(11)                                         /* (ETH_ISRQ) HRESP Not OK Position */
#define ETH_ISRQ_HRESP_Msk                    (_UINT32_(0x1) << ETH_ISRQ_HRESP_Pos)                /* (ETH_ISRQ) HRESP Not OK Mask */
#define ETH_ISRQ_HRESP(value)                 (ETH_ISRQ_HRESP_Msk & (_UINT32_(value) << ETH_ISRQ_HRESP_Pos)) /* Assignment of value for HRESP in the ETH_ISRQ register */
#define ETH_ISRQ_Msk                          _UINT32_(0x00000CFE)                                 /* (ETH_ISRQ) Register Mask  */


/* -------- ETH_TBPQB : (ETH Offset: 0x1440) (R/W 32) Transmit Priority Queue Buffer Base Address -------- */
#define ETH_TBPQB_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_TBPQB) Transmit Priority Queue Buffer Base Address  Reset Value */

#define ETH_TBPQB_Msk                         _UINT32_(0x00000000)                                 /* (ETH_TBPQB) Register Mask  */


/* -------- ETH_RBPQB : (ETH Offset: 0x1480) (R/W 32) Receive Priority Queue Buffer Base Address -------- */
#define ETH_RBPQB_RESETVALUE                  _UINT32_(0x00)                                       /*  (ETH_RBPQB) Receive Priority Queue Buffer Base Address  Reset Value */

#define ETH_RBPQB_Msk                         _UINT32_(0x00000000)                                 /* (ETH_RBPQB) Register Mask  */


